# -*- coding: utf-8 -*-
"""
Завдання 17.4

Створити функцію write_last_log_to_csv.

Аргументи функції:
* source_log - ім'я файлу у форматі csv, з якого читаються дані (mail_log.csv)
* output - ім'я файлу у форматі CSV, в який буде записаний результат

Функція нічого не повертає.

Функція write_last_log_to_csv обробляє csv файл mail_log.csv. У файлі
mail_log.csv є логи зміни імені користувача. При цьому email користувач
змінювати не може, тільки ім'я.

Функція write_last_log_to_csv повинна відбирати з файлу mail_log.csv тільки
найсвіжіші записи для кожного користувача та записувати їх до іншого csv файлу.
У файлі output першим рядком повинні бути заголовки стовпців, такі як у файлі
source_log.

Для частини користувачів запис тільки один і тоді у підсумковий файл треба
записати лише його. Деякі користувачі мають кілька записів з різними іменами.
Наприклад користувач з email c3po@gmail.com кілька разів змінював ім'я:
C=3PO,c3po@gmail.com,16/12/2019 17:10
C3PO,c3po@gmail.com,16/12/2019 17:15
C-3PO,c3po@gmail.com,16/12/2019 17:24

З цих трьох записів, в підсумковий файл має бути записана тільки одна -
найсвіжіша:
C-3PO,c3po@gmail.com,16/12/2019 17:24

Для порівняння дат зручно використовувати об'єкти datetime з модуля datetime.
Щоб спростити роботу з датами, створено функцію convert_str_to_datetime - вона
конвертує рядок з датою у форматі 11/10/2019 14:05 в об'єкт datetime. Отримані
об'єкти datetime можна порівнювати між собою. Друга функція
convert_datetime_to_str робить зворотну операцію - перетворює об'єкт datetime
на рядок.

Функції convert_str_to_datetime та convert_datetime_to_str використовувати не
обов'язково.

"""

import datetime


def convert_str_to_datetime(datetime_str):
    """
    Конвертує рядок із датою у форматі 11/10/2019 14:05 в об'єкт datetime.
    """
    return datetime.datetime.strptime(datetime_str, "%d/%m/%Y %H:%M")


def convert_datetime_to_str(datetime_obj):
    """
    Конвертує об'єкт datetime у рядок з датою у форматі 11/10/2019 14:05
    """
    return datetime.datetime.strftime(datetime_obj, "%d/%m/%Y %H:%M")
