# -*- coding: utf-8 -*-
"""
Завдання 17.2

У цьому завданні потрібно:
* взяти вміст кількох файлів із виводом команди sh version
* розпарсити вивід команди за допомогою регулярних виразів та отримати інформацію про пристрій
* записати отриману інформацію у файл у CSV форматі

Для виконання завдання потрібно створити дві функції.

Функція parse_sh_version:
* очікує як аргумент на вивід команди sh version одним рядком (не ім'я файлу)
* обробляє вивід, за допомогою регулярних виразів
* повертає кортеж із трьох елементів:
  * ios - у форматі "12.4(5)T"
  * image - у форматі "flash:c2800-advipservicesk9-mz.124-5.T.bin"
  * uptime - у форматі "5 days, 3 hours, 3 minutes"

Функція write_inventory_to_csv має два параметри:
* data_filenames - чекає як аргумент на список імен файлів з виводом sh version
* csv_filename - чекає як аргумент на ім'я файлу (наприклад,
  routers_inventory.csv), в який буде записана інформація у форматі CSV

Функція записує вміст у файл, у форматі CSV і нічого не повертає.
Функція write_inventory_to_csv повинна виконувати наступне:
* обробити інформацію з кожного файлу з виводом sh version: sh_version_r1.txt,
  sh_version_r2.txt, sh_version_r3.txt
* за допомогою функції parse_sh_version, з кожного висновку має бути отримана
  інформація ios, image, uptime
* з імені файлу потрібно отримати ім'я хоста
* після цього вся інформація має бути записана в CSV файл

У файлі routers_inventory.csv повинні бути такі стовпці (саме в цьому порядку):
hostname, ios, image, uptime

У скрипті за допомогою модуля glob створено список файлів, ім'я яких
починається на sh_vers. Ви можете прокоментувати рядок print(sh_version_files),
щоб переглянути вміст списку.

Крім того, створено список заголовків (headers), який має бути записаний у CSV.
"""

import glob

sh_version_files = glob.glob("sh_vers*")
# print(sh_version_files)

headers = ["hostname", "ios", "image", "uptime"]
