# -*- coding: utf-8 -*-
"""
Завдання 12.1

Створити функцію ping_ip_addresses, яка перевіряє чи пінгуються IP-адреси.
Функція очікує як аргумент на список IP-адрес.

Функція має повертати кортеж із двома списками:
* список доступних IP-адрес
* список недоступних IP-адрес

Для перевірки доступності IP-адреси, використовуйте ping (запуск ping через
subprocess). IP-адреса вважається доступною, якщо виконання команди ping
відпрацювало з кодом 0 (returncode). Нюанси: на Windows returncode може
дорівнювати 0 не тільки, коли ping був успішний, але для завдання потрібно
перевіряти саме код. Це зроблено для спрощення тестів.

"""
