# -*- coding: utf-8 -*-
"""
Завдання 12.2

Функція ping_ip_addresses із завдання 12.1 приймає лише список адрес, але було
б зручно мати можливість вказувати адреси за допомогою діапазону, наприклад,
192.168.100.1-10.

У цьому завданні необхідно створити функцію convert_ranges_to_ip_list, яка
конвертує список IP-адрес у різних форматах у список, де кожна IP-адреса
вказана окремо.

Функція очікує як аргумент на список, в якому містяться IP-адреси та/або
діапазони IP-адрес.

Елементи списку можуть бути у форматі:
* 10.1.1.1
* 10.1.1.1-10.1.1.10
* 10.1.1.1-10

Якщо адреса вказана як діапазон, потрібно розгорнути діапазон в окремі адреси,
включаючи останню адресу діапазону. Для спрощення завдання можна вважати, що в
діапазоні завжди змінюється тільки останній октет адреси.
Функція повертає список IP-адрес.

Приклад виклику функції
In [3]: convert_ranges_to_ip_list(['8.8.4.4', '1.1.1.1-3', '172.21.41.128-172.21.41.132'])
Out[3]:
['8.8.4.4',
 '1.1.1.1',
 '1.1.1.2',
 '1.1.1.3',
 '172.21.41.128',
 '172.21.41.129',
 '172.21.41.130',
 '172.21.41.131',
 '172.21.41.132']

In [4]: convert_ranges_to_ip_list(['8.8.4.4', '1.1.1.10-12', '10.1.1.1-10.1.1.4'])
Out[4]:
['8.8.4.4',
 '1.1.1.10',
 '1.1.1.11',
 '1.1.1.12',
 '10.1.1.1',
 '10.1.1.2',
 '10.1.1.3',
 '10.1.1.4']

"""
