# -*- coding: utf-8 -*-
"""
Завдання 12.3

Створити функцію print_ip_table, яка відображає таблицю доступних та
недоступних IP-адрес.

Функція очікує як аргументи на два списки:
* список доступних IP-адрес
* список недоступних IP-адрес

Результат роботи функції – вивід на стандартний потік виведення таблиці:

Reachable    Unreachable
-----------  -------------
10.1.1.1     10.1.1.7
10.1.1.2     10.1.1.8
             10.1.1.9

Функція нічого не повертає, лише робить print.

Приклад виклику функції
In [6]: reach_ip = ["10.1.1.1", "10.1.1.2"]
In [7]: unreach_ip = ["10.1.1.7", "10.1.1.8", "10.1.1.9"]

In [8]: print_ip_table(reach_ip, unreach_ip)
Reachable    Unreachable
-----------  -------------
10.1.1.1     10.1.1.7
10.1.1.2     10.1.1.8
             10.1.1.9

"""
