# -*- coding: utf-8 -*-

"""
Завдання 23.1

У цьому завданні необхідно створити клас IPAddress.

При створенні екземпляра класу, як аргумент передається IP-адреса та маска,
а також має виконуватися перевірка правильності адреси та маски:
* Адреса вважається коректно заданою, якщо вона:
  * складається з 4 чисел розділених точкою
  * кожне число в діапазоні від 0 до 255
* маска вважається коректною, якщо це число в діапазоні від 8 до 32 включно

Якщо маска або адреса не пройшли перевірку, необхідно згенерувати виняток
ValueError з відповідним текстом (вивід нижче).

Також, при створенні класу, повинні бути створені два атрибути екземпляра:
ip і mask, в яких містяться адреса (рядок) та маска (число) відповідно.

Приклад створення екземпляра класу:
In [1]: ip = IPAddress('10.1.1.1/24')

Атрибути ip та mask
In [2]: ip1 = IPAddress('10.1.1.1/24')

In [3]: ip1.ip
Out[3]: '10.1.1.1'

In [4]: ip1.mask
Out[4]: 24


Перевірка правильності адреси (traceback скорочено)
In [5]: ip1 = IPAddress('10.1.1/24')
---------------------------------------------------------------------------
...
ValueError: Incorrect IPv4 address

Перевірка правильності маски (traceback скорочено)
In [6]: ip1 = IPAddress('10.1.1.1/240')
---------------------------------------------------------------------------
...
ValueError: Incorrect mask

"""
