# -*- coding: utf-8 -*-
"""
Завдання 19.1

Створити функцію ping_ip_addresses, яка перевіряє чи пінгуються IP-адреси.
Перевірка IP-адрес повинна виконуватися паралельно в різних потоках.

Параметри функції ping_ip_addresses:
* ip_list - список IP-адрес
* limit – максимальна кількість паралельних потоків (за замовчуванням 3)

Функція має повертати кортеж із двома списками:
* список доступних IP-адрес
* список недоступних IP-адрес

Для виконання завдання можна створювати додаткові функції.

Для перевірки доступності IP-адреси використовуйте ping.

Підказка про роботу з concurrent.futures: Якщо необхідно пінгувати кілька
IP-адрес у різних потоках, потрібно створити функцію, яка пінгуватиме одну
IP-адресу, а потім запустити цю функцію в різних потоках для різних IP-адрес за
допомогою concurrent.futures (це треба зробити функції ping_ip_addresses).
"""
