"""
Завдання 11.2

Створити функцію prompt_user_ip, яка запитує користувача введення IP-адреси,
перевіряє правильність введеної адреси і, якщо вона неправильна, запитує адресу
знову. Якщо користувач ввів правильну IP-адресу, функція повертає її.

Функція prompt_user_ip повинна мати такі параметри:
* max_retry – максимальна кількість спроб введення IP-адреси. Значення за замовчанням 5.
* ensure_unicast - якщо параметру передано значення True, адреса має бути не
  тільки правильною в цілому, але і має бути саме unicast адресою, тобто перший
  октет адреси повинен бути в діапазоні 1-223. Можливі значення True/False.
  Значення за замовчанням False.

Якщо після max_retry спроб не було введено правильну адресу, функція повинна
генерувати виняток ValueError такого виду (n = max_retry):
ValueError: Після n спроб не було введено правильну адресу

IP-адреса вважається правильною, якщо вона:
* складається з 4 чисел (а не літер чи інших символів)
* числа розділені точкою
* кожне число в діапазоні від 0 до 255

Приклад роботи функції:

In [7]: prompt_user_ip(max_retry=5, ensure_unicast=False)
Введіть IP-адресу: 10.1.1.1.1
Неправильна IP-адреса
Введіть IP-адресу: 10.1.1.1
Out[7]: '10.1.1.1'

In [8]: prompt_user_ip(max_retry=5, ensure_unicast=False)
Введіть IP-адресу: 110.1.500.1
Неправильна IP-адреса
Введіть IP-адресу: 4.4.4.4
Out[8]: '4.4.4.4'

In [9]: prompt_user_ip(max_retry=3, ensure_unicast=False)
Введіть IP-адресу: a
Неправильна IP-адреса
Введіть IP-адресу: a
Неправильна IP-адреса
Введіть IP-адресу: a
Неправильна IP-адреса
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
...
ValueError: Після 3 спроб не було введено правильну адресу

In [10]: prompt_user_ip(max_retry=5, ensure_unicast=True)
Введіть IP-адресу: 255.255.255.255
Неправильна IP-адреса. Введіть IP-адресу в діапазоні unicast: 1-223
Введіть IP-адресу: 10.1.1.1
Out[10]: '10.1.1.1'

In [12]: prompt_user_ip(max_retry=3, ensure_unicast=True)
Введіть IP-адресу: 0.0.0.0
Неправильна IP-адреса. Введіть IP-адресу в діапазоні unicast: 1-223
Введіть IP-адресу: 0.0.0.0
Неправильна IP-адреса. Введіть IP-адресу в діапазоні unicast: 1-223
Введіть IP-адресу: 0.0.0.0
Неправильна IP-адреса. Введіть IP-адресу в діапазоні unicast: 1-223
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
...
ValueError: Після 3 спроб не було введено правильну адресу

"""
