"""
Завдання 11.2

Створити функцію prompt_user_ip, яка запитує користувача введення IP-адреси,
перевіряє правильність введеної адреси і, якщо вона неправильна, запитує адресу
знову. Якщо користувач ввів правильну IP-адресу, функція повертає її.

Функція prompt_user_ip повинна мати такі параметри:
* max_retry – максимальна кількість спроб введення IP-адреси. Значення за замовчанням 5.
* ensure_unicast - якщо параметру передано значення True, адреса має бути не
  тільки правильною в цілому, але і має бути саме unicast адресою, тобто перший
  октет адреси повинен бути в діапазоні 1-223. Можливі значення True/False.
  Значення за замовчанням False.

IP-адреса вважається правильною, якщо вона:
* складається з 4 чисел (а не літер чи інших символів)
* числа розділені точкою
* кожне число в діапазоні від 0 до 255

Приклад роботи функції:

In [7]: prompt_user_ip(max_retry=5, ensure_unicast=False)
Введите правильный IP-адрес: 10.1.1.1.1
Неправильный IP-адрес
Введите правильный IP-адрес: 10.1.1.1
Out[7]: '10.1.1.1'

In [8]: prompt_user_ip(max_retry=5, ensure_unicast=False)
Введите правильный IP-адрес: 110.1.500.1
Неправильный IP-адрес
Введите правильный IP-адрес: 4.4.4.4
Out[8]: '4.4.4.4'

In [9]: prompt_user_ip(max_retry=3, ensure_unicast=False)
Введите правильный IP-адрес: a
Неправильный IP-адрес
Введите правильный IP-адрес: a
Неправильный IP-адрес
Введите правильный IP-адрес: a
Неправильный IP-адрес
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
...
ValueError: После 3 попыток не был введен правильный адрес

In [10]: prompt_user_ip(max_retry=5, ensure_unicast=True)
Введите правильный IP-адрес: 255.255.255.255
Введите IP-адрес в диапазоне unicast: 1-223
Введите правильный IP-адрес: 10.1.1.1
Out[10]: '10.1.1.1'

In [12]: prompt_user_ip(max_retry=3, ensure_unicast=True)
Введите правильный IP-адрес: 0.0.0.0
Введите IP-адрес в диапазоне unicast: 1-223
Введите правильный IP-адрес: 0.0.0.0
Введите IP-адрес в диапазоне unicast: 1-223
Введите правильный IP-адрес: 0.0.0.0
Введите IP-адрес в диапазоне unicast: 1-223
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
...
ValueError: После 3 попыток не был введен правильный адрес

"""
