# -*- coding: utf-8 -*-
"""
Завдання 25.5a

Для завдань 25 розділу немає тестів!

Після виконання завдання 25.5 у таблиці dhcp є нове поле last_active.

Оновіть скрипт add_data.py таким чином, щоб видаляти всі записи, які були
активними більше 7 днів тому.

Для того, щоб отримати такі записи, можна просто вручну оновити поле
last_active в деяких записах і встановити час 7 або більше днів.
У файлі завдання описаний приклад роботи з об'єктами модуля datetime.
Показано, як отримати дату 7 днів тому.

З цією датою треба буде порівнювати час last_active.
Зверніть увагу, що рядки з датою, які пишуться до БД, можна порівнювати між
собою.

"""

from datetime import timedelta, datetime

now = datetime.today().replace(microsecond=0)
week_ago = now - timedelta(days=7)

# print(now)
# print(week_ago)
# print(now > week_ago)
# print(str(now) > str(week_ago))
