# -*- coding: utf-8 -*-
"""
Завдання 18.1a

Копіювати функцію send_show_command із завдання 18.1 і переробити її таким
чином, щоб оброблявся виняток, що генерується при помилці автентифікації на
пристрої.

У разі виникнення помилки, на стандартний потік виводу має виводитися
повідомлення виключення.

Щоб перевірити, змініть пароль на пристрої або у файлі devices.yaml.

У цьому розділі тести перевіряють підключення на пристроях у файлі
devices.yaml. Якщо параметри підключення до ваших пристроїв відрізняються,
потрібно змінити параметри у файлі devices.yaml.
"""
