# -*- coding: utf-8 -*-
"""
Завдання 18.1b

Копіювати функцію send_show_command із завдання 18.1a і переробити її таким
чином, щоб оброблявся не тільки виняток, який генерується при помилці
автентифікації на пристрої, але й виняток, який генерується, коли IP-адреса
пристрою недоступна.

У разі виникнення помилки, на стандартний потік виводу має виводитися
повідомлення виключення.

Щоб перевірити, змініть IP-адресу на пристрої або файлі devices.yaml.

У цьому розділі тести перевіряють підключення на пристроях у файлі
devices.yaml. Якщо параметри підключення до ваших пристроїв відрізняються,
потрібно змінити параметри у файлі devices.yaml.
"""
