# -*- coding: utf-8 -*-
"""
Завдання 18.2a

Копіювати функцію send_config_commands із завдання 18.2 і додати параметр log,
який контролює, чи буде виводиться на стандартний потік виводу інформація
про те, до якого пристрою виконується підключення. За замовчуванням результат
має виводитися.

Приклад роботи функції:

In [13]: result = send_config_commands(r1, commands)
Connecting to 192.168.100.1...

In [14]: result = send_config_commands(r1, commands, log=False)

In [15]:

Скрипт повинен надсилати список команд commands на всі пристрої з файлу
devices.yaml за допомогою функції send_config_commands.

У цьому розділі тести перевіряють підключення на пристроях у файлі
devices.yaml. Якщо параметри підключення до ваших пристроїв відрізняються,
потрібно змінити параметри у файлі devices.yaml.
"""
