# -*- coding: utf-8 -*-
"""
Завдання 20.5

Створити шаблони templates/gre_ipsec_vpn_1.txt та templates/gre_ipsec_vpn_2.txt,
які генерують конфігурацію IPsec over GRE між двома маршрутизаторами.

Шаблон templates/gre_ipsec_vpn_1.txt створює конфігурацію для однієї сторони
тунелю, а templates/gre_ipsec_vpn_2.txt – для другої.

Приклади конфігурації, яка повинна створюватись на основі шаблонів у файлах:
cisco_vpn_1.txt та cisco_vpn_2.txt.

Шаблони потрібно створювати вручну, скопіювавши частини конфіга у відповідні
шаблони.

Створити функцію create_vpn_config, яка використовує ці шаблони для створення
конфігурації VPN на основі даних у словнику data.

Параметри функції:
* template1 - ім'я файлу із шаблоном, який створює конфігурацію для однієї строни тунелю
* template2 - ім'я файлу із шаблоном, який створює конфігурацію для другої строни тунелю
* data_dict - словник із значеннями, які треба підставити у шаблони

Функція повинна повертати кортеж із двома конфігураціями (рядки), які отримані
на основі шаблонів.

Приклади конфігурацій VPN, які має повертати функція create_vpn_config у файлах
cisco_vpn_1.txt та cisco_vpn_2.txt.
"""

data = {
    "tun_num": 10,
    "wan_ip_1": "192.168.100.1",
    "wan_ip_2": "192.168.100.2",
    "tun_ip_1": "10.0.1.1 255.255.255.252",
    "tun_ip_2": "10.0.1.2 255.255.255.252",
}
