# -*- coding: utf-8 -*-
"""
Завдання 15.1a

Копіювати функцію get_ip_from_cfg із завдання 15.1 та переробити її таким
чином, щоб вона повертала словник:
* ключ: ім'я інтерфейсу
* значення: кортеж з двома рядками: IP-адреса, маска

До словника додавати лише ті інтерфейси, на яких налаштовані IP-адреси.

Наприклад (взяті довільні адреси):
{'FastEthernet0/1': ('10.0.1.1', '255.255.255.0'),
 'FastEthernet0/2': ('10.0.2.1', '255.255.255.0')}

Для отримання такого результату використовуйте регулярні вирази.
Перевірити функцію на прикладі файлу config_r1.txt.

Зверніть увагу, що в даному випадку можна не перевіряти коректність IP-адреси,
діапазони адрес і так далі, оскільки обробляється вивід команди, а не
введення користувача.

Приклад виклику функції
In [2]: get_ip_from_cfg("config_r1.txt")
Out[2]:
{'Loopback0': ('10.1.1.1', '255.255.255.255'),
 'Ethernet0/0': ('10.0.13.1', '255.255.255.0'),
 'Ethernet0/2': ('10.0.19.1', '255.255.255.0')}

"""
