def test_task_stdout(capsys):
    """
    Перевірка роботи завдання
    """
    import task_4_7

    out, err = capsys.readouterr()
    correct_stdout = "101010101010101010111011101110111100110011001100"
    assert out, (
        "Нічого не виведено стандартний потік виведення. Потрібно не лише "
        "отримати потрібний результат, але й вивести його на стандартний потік "
        "виведення за допомогою print"
    )
    assert (
        correct_stdout == out.strip()
    ), "На стандартний потік виведення виводиться неправильний рядок"
